docs/xpath/location-path.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-26 日 10:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>xpath 之location path</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">xpath 之location path</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd04c328">1. 前言</a></li>
<li><a href="#org424ec5b">2. location path</a>
<ul>
<li><a href="#org1cf58a4">2.1. 简写后的语法</a></li>
<li><a href="#org64b57ef">2.2. 啰嗦的语法</a></li>
<li><a href="#org00a0869">2.3. 相对路径与绝对路径</a></li>
</ul>
</li>
<li><a href="#org8cb7bf1">3. location step</a>
<ul>
<li><a href="#org746182b">3.1. 轴描述语法（axis）</a></li>
<li><a href="#orgd99cca3">3.2. 节点测试（node test）</a></li>
<li><a href="#org81249e9">3.3. 谓词（Predicates）</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd04c328" class="outline-2">
<h2 id="orgd04c328"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
建议首先阅读 <a href="https://zh.wikipedia.org/wiki/XPath">xpath on wiki</a> ，了解 xpath 的基本用法，这是将 xpath 介绍的最清楚的文章了，比 w3c 上文章要好。
</p>

<p>
然后可以阅读相关标准：<a href="https://www.w3.org/TR/1999/REC-xpath-19991116/">XML Path Language (XPath) Version 1.0</a>
</p>

<p>
本文内容根据标准，结合 wiki 整理。
</p>
</div>
</div>

<div id="outline-container-org424ec5b" class="outline-2">
<h2 id="org424ec5b"><span class="section-number-2">2</span> location path</h2>
<div class="outline-text-2" id="text-2">
<p>
最常见的 XPath 表达式是路径（location path)。路径是从一个 XML 节点（当前的上下文节点（context node））到另一个节点、或一组节点的步骤（location steps）顺序。这些步骤（step）以 <code>/</code> 字符分开。
</p>

<p>
一般情况下，我们使用简写后的语法。虽然完整的轴描述是一种更加贴近人类语言，利用自然语言的单词和语法来书写的描述方式，但是相比之下也更加罗嗦。
</p>
</div>

<div id="outline-container-org1cf58a4" class="outline-3">
<h3 id="org1cf58a4"><span class="section-number-3">2.1</span> 简写后的语法</h3>
<div class="outline-text-3" id="text-2-1">
<p>
最简单的 XPath 如下：
</p>
<pre class="example">
   /A/B/C
</pre>

<p>
此时选择的 C 节点是：C 节点必须是 B 的子节点（B/C），同时 B 节点必须是 A 的子节点（A/B），而 A 是这个 XML 文档的根节点（/A）。这种描述法类似于磁盘中文件的路径（URI），从盘符开始顺着一级一级的目录最终找到文件。
</p>

<p>
这里还有一个复杂一些的例子：
</p>
<pre class="example">
   A//B/*[1]
</pre>

<p>
此时选择的元素是：在 B 节点下的第一个节点（ <code>B/*[1]</code> ），不论节点的名称如何（*）；而 B 节点必须出现在 A 节点内，不论和 A 节点之间相隔几层节点（//B）；与此同时 A 节点还必须是当前节点的子节点（A，前边没有/）。
</p>
</div>
</div>

<div id="outline-container-org64b57ef" class="outline-3">
<h3 id="org64b57ef"><span class="section-number-3">2.2</span> 啰嗦的语法</h3>
<div class="outline-text-3" id="text-2-2">
<p>
在未缩写语法里，两个上述范例可以写为：
</p>
<pre class="example">
   /child::A/child::B/child::C
   child::A/descendant-or-self::B/child::node()[1]
</pre>

<p>
在 XPath 的每个步骤里，通过完整的轴描述（例如：child 或 descendant-or-self）进行明确的指定，然后使用::，它的后面跟着节点测试的内容，例如上面范例所示的 A 以及 node()。
</p>
</div>
</div>

<div id="outline-container-org00a0869" class="outline-3">
<h3 id="org00a0869"><span class="section-number-3">2.3</span> 相对路径与绝对路径</h3>
<div class="outline-text-3" id="text-2-3">
<p>
有两种位置路径：相对位置路径和绝对位置路径。
</p>

<p>
相对位置路径由一个或多个由 <code>/</code> 分隔的位置步骤（location step）组成。相对位置路径中的步骤（step）从左到右组合在一起。每个步骤依次选择相对于上下文节点的一组节点。例如， <code>child::div/child::para</code> 选择上下文节点中 div 元素的 para 子元素。
</p>

<p>
绝对位置路径由 <code>/</code> 可选地后跟相对位置路径组成。 <code>/</code> 本身选择包含上下文节点的文档的根节点。
</p>
</div>
</div>
</div>

<div id="outline-container-org8cb7bf1" class="outline-2">
<h2 id="org8cb7bf1"><span class="section-number-2">3</span> location step</h2>
<div class="outline-text-2" id="text-3">
<p>
location step 由 3 各部分组成：
</p>
<ul class="org-ul">
<li>一个轴（axis），它指定由步骤选中的节点和上下文节点之间的树关系。</li>
<li>一个节点测试（node tes），它指定由步骤选中的节点的节点类型和扩展名。</li>
<li>零个或多个谓词（Predicates），它使用任意表达式来进一步细化步骤选择的节点集。</li>
</ul>

<p>
步骤的语法是用双冒号分隔的轴名称和节点测试，后跟方括号中的零个或多个表达式。例如：
</p>
<pre class="example">
  child::para[position()=1]
</pre>
<p>
child 是轴的名称，para 是节点测试，[position()=1]是谓词。
</p>

<p>
由步骤选择的节点集是通过从轴和节点测试生成初始节点集，然后依次过滤每个谓词的节点集而得到的节点集。
</p>
</div>

<div id="outline-container-org746182b" class="outline-3">
<h3 id="org746182b"><span class="section-number-3">3.1</span> 轴描述语法（axis）</h3>
<div class="outline-text-3" id="text-3-1">
<p>
常见的轴有：
</p>

<table border="1" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" width="auto">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">坐标</th>
<th scope="col" class="org-left">名称</th>
<th scope="col" class="org-left">说明</th>
<th scope="col" class="org-left">缩写语法</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">child</td>
<td class="org-left">子节点</td>
<td class="org-left">比自身节点深度大的一层的节点，且被包含在自身之内</td>
<td class="org-left">默认，不需要</td>
</tr>

<tr>
<td class="org-left">attribute</td>
<td class="org-left">属性</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">@</td>
</tr>

<tr>
<td class="org-left">descendant</td>
<td class="org-left">子孙节点</td>
<td class="org-left">比自身节点深度大的节点，且被包含在自身之内</td>
<td class="org-left">不提供</td>
</tr>

<tr>
<td class="org-left">descendant-or-self</td>
<td class="org-left">自身引用及子孙节点</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">//</td>
</tr>

<tr>
<td class="org-left">parent</td>
<td class="org-left">父节点</td>
<td class="org-left">比自身节点深度小一层的节点，且包含自身</td>
<td class="org-left">..</td>
</tr>

<tr>
<td class="org-left">ancestor</td>
<td class="org-left">祖先节点</td>
<td class="org-left">比自身节点深度小的节点，且包含自身</td>
<td class="org-left">不提供</td>
</tr>

<tr>
<td class="org-left">ancestor-or-self</td>
<td class="org-left">自身引用及祖先节点</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">不提供</td>
</tr>

<tr>
<td class="org-left">following</td>
<td class="org-left">下文节点</td>
<td class="org-left">按纵轴视图，在此节点后的所有完整节点，即不包含其祖先节点</td>
<td class="org-left">不提供</td>
</tr>

<tr>
<td class="org-left">preceding</td>
<td class="org-left">前文节点</td>
<td class="org-left">按纵轴视图，在此节点前的所有完整节点，即不包含其子孙节点</td>
<td class="org-left">不提供</td>
</tr>

<tr>
<td class="org-left">following-sibling</td>
<td class="org-left">下一个同级节点</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">不提供</td>
</tr>

<tr>
<td class="org-left">preceding-sibling</td>
<td class="org-left">上一个同级节点</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">不提供</td>
</tr>

<tr>
<td class="org-left">self</td>
<td class="org-left">自己</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">.</td>
</tr>

<tr>
<td class="org-left">namespace</td>
<td class="org-left">命名空间</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">不提供</td>
</tr>
</tbody>
</table>

<p>
关于使用 attribute 坐标简写语法的一个范例： <code>//a/@href</code>  在文件树里任何地方的元素下选择了一个叫 href 的属性。
</p>

<p>
self 坐标通常与节点描述同用，以参考现行选定节点。例如， <code>h3[.='See also']</code> 在现行上下文选取了叫 h3 的元素，该元素文字内容是 See also。
</p>
</div>
</div>

<div id="outline-container-orgd99cca3" class="outline-3">
<h3 id="orgd99cca3"><span class="section-number-3">3.2</span> 节点测试（node test）</h3>
<div class="outline-text-3" id="text-3-2">
<p>
每个轴都有一个主节点类型。如果一个轴可以包含元素，那么主节点类型就是元素; 否则，它是轴可以包含的节点类型。 从而，
</p>
<ul class="org-ul">
<li>对于属性轴，主节点类型是属性。</li>
<li>对于命名空间轴，主节点类型是名称空间。</li>
<li>对于其他轴，主节点类型是元素。</li>
</ul>

<p>
于主节点类型的任何节点，节点测试 <code>*</code> 为 true。例如， <code>child::*</code> 将选择上下文节点的所有元素子节点， <code>attribute::*</code> 将选择上下文节点的所有属性。
</p>

<p>
对于任何文本节点，节点测试  <code>text()</code> 都为 true。 例如， <code>child::text()</code> 将选择上下文节点的文本节点类型子节点。 类似地，节点测试 <code>comment()</code> 于任何注释节点都为真，并且对于任何处理指令，节点测试  <code>processing-instruction()</code> 都为真。 <code>processing-instruction()</code> 测试可能有一个 Literal 参数; 在这种情况下，对于任何名称等于 Literal 值的处理指令都是如此。
</p>

<p>
对于任何类型的任何节点，节点测试 <code>node()</code> 都为 true。
</p>
</div>
</div>

<div id="outline-container-org81249e9" class="outline-3">
<h3 id="org81249e9"><span class="section-number-3">3.3</span> 谓词（Predicates）</h3>
<div class="outline-text-3" id="text-3-3">
<p>
谓词为一个逻辑真假表达式，任何真假判断表达式都可在节点后方括号里表示，在某一步骤可有多少个描述并没有限制。
</p>

<p>
谓词过滤相对于轴的节点集以产生新的节点集。如果对该节点的计算结果为 true，则该节点包含在新节点集中；否则，它不包括在内。
</p>

<p>
例如： <code>//a[@href='help.php']</code> ，这将检查元素 a 有没有 href 属性，并且该它的值是 help.php。
</p>

<p>
复杂一些的范例如下：
</p>
<pre class="example">
   //a[@href='help.php'][../div/@class='header']/@target
</pre>

<p>
或
</p>
<pre class="example">
   //a[@href='help.php'][name(..)='div'][../@class='header']/@target
</pre>

<p>
此例将会选择符合条件的元素 a 的 target 属性。 要求元素 a：
</p>
<ul class="org-ul">
<li>具有属性 href 且值为 help.php；</li>
<li>并且元素 a 具有父元素 div；</li>
<li>并且父元素（div）其自身具备 class 属性，值为 header。</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-04-26 日 10:55</p>
<p class="validation"></p>
</div>
</body>
</html>
